package abstr;

/**
 * Класс, позволяющий получить информацию о том, в каком поле возникла ошибка и какие содержание она имеет
 * @author group2
 * @version 1.0
 */
public final class InputError {
    /**Объявление строковых переменных, хранящих имя поля, в котором возникла ошибка и текст ошибки */
    private String name, message;

    /**
     * Конструктор, присваивающий переменным, объявленным в классе, значения, поступившие извне
     * @param name - имя поля, в которое были введены некорректные данные
     * @param message - текст ошибки, возникшей при вводе в поле некорректных данных
     */
    public InputError(String name, String message) {
        this.name = name;
        this.message = message;
    }
    /**
     * Метод, возвращающий имя поля, в которое были введены некорректные данные
     * @return the name - имя поля, в которое были введены некорректные данные
     */
    public String getName() {
        return this.name;
    }
    /**
     * Метод, возвращающий текст ошибки, возникшей при вводе в поле некорректных данных
     * @return the message - текст ошибки, возникшей при вводе в поле некорректных данных
     */
    public String getMessage() {
        return this.message;
    }

}
